betaflight/betaflight/src/platform/STM32/timer_stdperiph.c
uint16_t timerGetPeriodByPrescaler(void *tim, uint16_t prescaler, uint32_t hz)
{
    if (hz == 0) {
        return 0;
    }
    return (uint16_t)((timerClockFromInstance(tim) / (prescaler + 1)) / hz);
}

uint16_t timerGetPrescalerByDesiredHertz(void *tim, uint32_t hz)
{
    // protection here for desired hertz > SystemCoreClock???
    if (hz == 0 || hz > timerClockFromInstance(tim)) {
        return 0;
    }
    return (uint16_t)((timerClockFromInstance(tim) + hz / 2 ) / hz) - 1;
}

void timerReset(const timerHardware_t *timHw)
{
    TIM_TypeDef *tim = (TIM_TypeDef *)timHw->tim;
    TIM_DeInit(tim);
}

void timerSetPeriod(const timerHardware_t *timHw, uint32_t period)
{
    TIM_TypeDef *tim = (TIM_TypeDef *)timHw->tim;
    tim->ARR = period;
}

uint32_t timerGetPeriod(const timerHardware_t *timHw)
{
    TIM_TypeDef *tim = (TIM_TypeDef *)timHw->tim;
    return tim->ARR;
}

void timerSetCounter(const timerHardware_t *timHw, uint32_t counter)
{
    TIM_TypeDef *tim = (TIM_TypeDef *)timHw->tim;
    tim->CNT = counter;
}

void timerDisable(const timerHardware_t *timHw)
{
    TIM_TypeDef *tim = (TIM_TypeDef *)timHw->tim;
    TIM_ITConfig(tim, TIM_IT_Update, DISABLE);
    TIM_Cmd(tim, DISABLE);
}

void timerEnable(const timerHardware_t *timHw)
{
    TIM_TypeDef *tim = (TIM_TypeDef *)timHw->tim;
    TIM_Cmd(tim, ENABLE);
    TIM_GenerateEvent(tim, TIM_EventSource_Update);
}

void timerEnableInterrupt(const timerHardware_t *timHw)
{
    TIM_TypeDef *tim = (TIM_TypeDef *)timHw->tim;
    TIM_ClearFlag(tim, TIM_FLAG_Update);
    TIM_ITConfig(tim, TIM_IT_Update, ENABLE);
}

uint32_t timerGetPrescaler(const timerHardware_t *timHw)
{
    return ((const TIM_TypeDef *)timHw->tim)->PSC;
}

void *timerFindTimerHandle(void *tim)
{
    UNUSED(tim);
    return NULL;
}

#endif
